Revit 2027 API
RebarTrimExtendData.CanAddBarGeometry Method
 Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanAddBarGeometry()
Public Function CanAddBarGeometry As Boolean
public:
bool CanAddBarGeometry()
member CanAddBarGeometry : unit -> bool
Return Value
Boolean
See Also
Reference
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace